{
    "Acne": [
        "Topical retinoids (such as tretinoin) - helps unclog pores and prevent new acne lesions from forming.",
        "Benzoyl peroxide - kills bacteria and reduces inflammation.",
        "Salicylic acid - helps unclog pores and reduces inflammation.",
        "Topical antibiotics (such as clindamycin) - helps kill bacteria and reduce inflammation.",
        "Oral antibiotics (such as doxycycline) - helps kill bacteria and reduce inflammation."
    ],
    "Basal cell carcinoma": [
        "Surgical excision - removal of the tumor and surrounding tissue.",
        "Mohs surgery - a specialized procedure to remove the cancerous tissue layer by layer, minimizing damage to healthy tissue.",
        "Radiation therapy - using high-energy radiation to destroy cancer cells.",
        "Topical chemotherapy - applying a cream or lotion containing medication to kill cancer cells."
    ],
    "Benign Keratosis-like Lesions (BKL)": [
        "Cryotherapy - using liquid nitrogen to freeze off the lesion.",
        "Electrodesiccation and curettage - scraping off the lesion and using an electric needle to destroy any remaining cells.",
        "Topical medications (such as imiquimod) - stimulates the immune system to attack the lesion.",
        "Shave excision - shaving off the lesion with a surgical blade."
    ],
    "Atopic dermatitis(Eczema)": [
        "Emollients - moisturizers that help to repair the skin barrier and reduce dryness.",
        "Topical corticosteroids - reduce inflammation and itching.",
        "Oral antihistamines - reduce itching and improve sleep.",
        "Light therapy (phototherapy) - exposing the skin to specific types of light to reduce inflammation."
    ],
    "Actinic keratosis(AK)": [
        "Cryotherapy - using liquid nitrogen to freeze off the lesion.",
        "Topical medications (such as imiquimod) - stimulates the immune system to attack the lesion.",
        "Chemical peels - applying a chemical solution to the skin to remove the lesion.",
        "Photodynamic therapy - applying a medication to the skin that is activated by light to destroy the lesion."
    ],
    "Melanoma": [
        "Surgical excision - removing the tumor and surrounding tissue.",
        "Immunotherapy - using medications to stimulate the immune system to attack cancer cells.",
        "Chemotherapy - using medications to kill cancer cells.",
        "Radiation therapy - using high-energy radiation to destroy cancer cells."
    ],
    "Psoriasis": [
        "Topical corticosteroids - reduce inflammation and itching.",
        "Topical retinoids - helps slow down the growth of skin cells.",
        "Topical calcineurin inhibitors (such as tacrolimus or pimecrolimus) -reduce inflammation and itching, particularly for sensitive areas like the face and neck.",
        "Phototherapy (UVB light therapy) - slows down skin cell turnover and reduces inflammation."
    ],

    "Tinea (Ringworm)": [
        "Antifungal creams, ointments or powders (such as clotrimazole, miconazole or terbinafine) - applied to the affected area for 2-4 weeks to kill the fungus.",
        "Oral antifungal medications (such as terbinafine or fluconazole) - prescribed for more severe or resistant cases.",
        "Keeping the affected area clean and dry - to prevent the fungus from spreading.",
        "Avoiding sharing personal items - such as towels, clothing, and combs to prevent the spread of the fungus to others.",
        "Washing clothes and bedding in hot water and drying them in a hot dryer - to kill any fungus that may be present."
    ]
    }